Autodesk.Revit.DB.ViewPlan.SetUnderlayRange(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the underlay base and underlay top to the specified levels.
baseLevelId:
The element id of a level in the project or InvalidElementId. If InvalidElementId,
then the underlay base level is not set and no elements will be displayed as underlay.
topLevelId:
The element id of a level in the project or InvalidElementId. If InvalidElementId,
then the underlay range is unbounded.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId baseLevelId does not correspond to a Level in the project.
-or-
The ElementId topLevelId does not correspond to a Level in the project.
-or-
The elevation of level topLevelId must be greater than the elevation of level baseLevelId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ViewPlan.SetUnderlayBaseLevel(Autodesk.Revit.DB.ElementId)
Sets the level whose elevation will determine the bottom of the underlay range.
The elevation of the next highest level will be used to determine the top of the underlay range.
Remarks:
If the level specified is the highest level, the underlay range will be unbounded.
The underlay range will consist of everything above the specified level.
levelId:
The element id of a level in the project or else InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId does not correspond to a Level in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ViewPlan.CheckPlanViewRangeValidity(Autodesk.Revit.DB.PlanViewRange)
Checks if the plan view range is valid.
planViewRange:
The view range to validate.
Returns:
List of enums describing any errors in the plan view range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewPlan.SetViewRange(Autodesk.Revit.DB.PlanViewRange)
Sets the view range.
planViewRange:
The view range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Plan view range is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewPlan.CreateAreaPlan(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new area plan ViewPlan.
document:
The document to which the area plan will be added.
areaSchemeId:
The id of the AreaScheme which will be used by the area plan.
levelId:
The id of the Level to associate with the area plan.
Returns:
The new area plan ViewPlan.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The AreaScheme id is not valid and cannot be used for area plan views.
-or-
The ElementId levelId does not correspond to a Level.
-or-
Plan view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewPlan.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new ViewPlan.
document:
The document to which the ViewPlan will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new ViewPlan.  The type needs to be a FloorPlan, CeilingPlan, AreaPlan, or StructuralPlan ViewType.
levelId:
The id of the Level to associate with the new plan view.
Returns:
The new ViewPlan.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view family type is not a plan view type.
-or-
The ElementId levelId does not correspond to a Level.
-or-
StructuralPlans can only be created when the structural discipline is enabled whereas FloorPlans and CeilingPlans can
only be created when architecture or MEP disciplines are enabled.
-or-
Plan view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013